<a href="https://colab.research.google.com/github/DSF-Kotaro/classroom/blob/main/%E3%83%93%E3%83%83%E3%82%B0%E3%83%87%E3%83%BC%E3%82%BF%E5%88%86%E6%9E%904_5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [101]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
from numpy.random import randn
from numpy import nan

In [2]:
obj = Series([3,6,9,12])
obj

0     3
1     6
2     9
3    12
dtype: int64

In [3]:
obj.values

array([ 3,  6,  9, 12])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
ww2_cos = Series([8700000,4300000,300000,2100000,400000],index=['USSR','Germany','China','Japnan','USA'])
ww2_cos

USSR       8700000
Germany    4300000
China       300000
Japnan     2100000
USA         400000
dtype: int64

In [6]:
ww2_cos['USA']

400000

In [7]:
ww2_cos > 4000000

USSR        True
Germany     True
China      False
Japnan     False
USA        False
dtype: bool

In [8]:
'USSR' in ww2_cos

True

In [9]:
nfl_frame = pd.read_csv('/content/List of all-time NFL win-loss records.csv',sep = ',')

In [10]:
nfl_frame

   Rank                  Team     GP  Won  Lost  Tied   Pct.  Season   Division
0     1     Green Bay Packers  1,385  769   578    38  0.569    1921  NFC North
1     2        Dallas Cowboys    930  526   398     6  0.569    1960   NFC East
2     3      Baltimore Ravens    400  225   174     1  0.564    1996  AFC North
3     4         Chicago Bears  1,418  777   599    42  0.563    1920  NFC North
4     5  New England Patriots    933  519   405     9  0.561    1960   AFC East
5     6        Miami Dolphins    849  468   377     4  0.554    1966   AFC East
6     7     Minnesota Vikings    919  495   413    11  0.545    1961  NFC North
7     8    Kansas City Chiefs    933  496   425    12  0.537    1960   AFC West
8     9   Pittsburgh Steelers  1,221  644   556    21  0.536    1933  AFC North
9    10   San Francisco 49ers  1,051  552   485    14  0.532    1950   NFC West

In [11]:
nfl_frame.columns

Index(['Rank', 'Team', 'GP', 'Won', 'Lost', 'Tied', 'Pct.', 'Season',
       'Division'],
      dtype='object')

In [12]:
nfl_frame['Season']

0    1921
1    1960
2    1996
3    1920
4    1960
5    1966
6    1961
7    1960
8    1933
9    1950
Name: Season, dtype: int64

In [13]:
nfl_frame.Team

0       Green Bay Packers
1          Dallas Cowboys
2        Baltimore Ravens
3           Chicago Bears
4    New England Patriots
5          Miami Dolphins
6       Minnesota Vikings
7      Kansas City Chiefs
8     Pittsburgh Steelers
9     San Francisco 49ers
Name: Team, dtype: object

In [14]:
nfl_frame[['Team','Season']]

                   Team  Season
0     Green Bay Packers    1921
1        Dallas Cowboys    1960
2      Baltimore Ravens    1996
3         Chicago Bears    1920
4  New England Patriots    1960
5        Miami Dolphins    1966
6     Minnesota Vikings    1961
7    Kansas City Chiefs    1960
8   Pittsburgh Steelers    1933
9   San Francisco 49ers    1950

In [15]:
DataFrame(nfl_frame,columns = ['Team','Season'])

                   Team  Season
0     Green Bay Packers    1921
1        Dallas Cowboys    1960
2      Baltimore Ravens    1996
3         Chicago Bears    1920
4  New England Patriots    1960
5        Miami Dolphins    1966
6     Minnesota Vikings    1961
7    Kansas City Chiefs    1960
8   Pittsburgh Steelers    1933
9   San Francisco 49ers    1950

In [16]:
DataFrame(nfl_frame,columns = ['Team','Season','Studium'])

                   Team  Season  Studium
0     Green Bay Packers    1921      NaN
1        Dallas Cowboys    1960      NaN
2      Baltimore Ravens    1996      NaN
3         Chicago Bears    1920      NaN
4  New England Patriots    1960      NaN
5        Miami Dolphins    1966      NaN
6     Minnesota Vikings    1961      NaN
7    Kansas City Chiefs    1960      NaN
8   Pittsburgh Steelers    1933      NaN
9   San Francisco 49ers    1950      NaN

In [17]:
nfl_frame.head(3)

   Rank               Team     GP  Won  Lost  Tied   Pct.  Season   Division
0     1  Green Bay Packers  1,385  769   578    38  0.569    1921  NFC North
1     2     Dallas Cowboys    930  526   398     6  0.569    1960   NFC East
2     3   Baltimore Ravens    400  225   174     1  0.564    1996  AFC North

In [18]:
nfl_frame.tail(3)

   Rank                 Team     GP  Won  Lost  Tied   Pct.  Season   Division
7     8   Kansas City Chiefs    933  496   425    12  0.537    1960   AFC West
8     9  Pittsburgh Steelers  1,221  644   556    21  0.536    1933  AFC North
9    10  San Francisco 49ers  1,051  552   485    14  0.532    1950   NFC West

In [19]:
nfl_frame['Stadium'] = "Levi's Stadium"
nfl_frame

   Rank                  Team     GP  ...  Season   Division         Stadium
0     1     Green Bay Packers  1,385  ...    1921  NFC North  Levi's Stadium
1     2        Dallas Cowboys    930  ...    1960   NFC East  Levi's Stadium
2     3      Baltimore Ravens    400  ...    1996  AFC North  Levi's Stadium
3     4         Chicago Bears  1,418  ...    1920  NFC North  Levi's Stadium
4     5  New England Patriots    933  ...    1960   AFC East  Levi's Stadium
5     6        Miami Dolphins    849  ...    1966   AFC East  Levi's Stadium
6     7     Minnesota Vikings    919  ...    1961  NFC North  Levi's Stadium
7     8    Kansas City Chiefs    933  ...    1960   AFC West  Levi's Stadium
8     9   Pittsburgh Steelers  1,221  ...    1933  AFC North  Levi's Stadium
9    10   San Francisco 49ers  1,051  ...    1950   NFC West  Levi's Stadium

[10 rows x 10 columns]

In [20]:
nfl_frame['Stadium'] = np.arange(10)
nfl_frame

   Rank                  Team     GP  Won  ...   Pct.  Season   Division  Stadium
0     1     Green Bay Packers  1,385  769  ...  0.569    1921  NFC North        0
1     2        Dallas Cowboys    930  526  ...  0.569    1960   NFC East        1
2     3      Baltimore Ravens    400  225  ...  0.564    1996  AFC North        2
3     4         Chicago Bears  1,418  777  ...  0.563    1920  NFC North        3
4     5  New England Patriots    933  519  ...  0.561    1960   AFC East        4
5     6        Miami Dolphins    849  468  ...  0.554    1966   AFC East        5
6     7     Minnesota Vikings    919  495  ...  0.545    1961  NFC North        6
7     8    Kansas City Chiefs    933  496  ...  0.537    1960   AFC West        7
8     9   Pittsburgh Steelers  1,221  644  ...  0.536    1933  AFC North        8
9    10   San Francisco 49ers  1,051  552  ...  0.532    1950   NFC West        9

[10 rows x 10 columns]

In [21]:
stadiums = Series(["Levi's stadium",'AT&T Stadium'],index =[4,0])
stadiums

4    Levi's stadium
0      AT&T Stadium
dtype: object

In [22]:
nfl_frame['Stadium'] = stadiums
nfl_frame

   Rank                  Team     GP  ...  Season   Division         Stadium
0     1     Green Bay Packers  1,385  ...    1921  NFC North    AT&T Stadium
1     2        Dallas Cowboys    930  ...    1960   NFC East             NaN
2     3      Baltimore Ravens    400  ...    1996  AFC North             NaN
3     4         Chicago Bears  1,418  ...    1920  NFC North             NaN
4     5  New England Patriots    933  ...    1960   AFC East  Levi's stadium
5     6        Miami Dolphins    849  ...    1966   AFC East             NaN
6     7     Minnesota Vikings    919  ...    1961  NFC North             NaN
7     8    Kansas City Chiefs    933  ...    1960   AFC West             NaN
8     9   Pittsburgh Steelers  1,221  ...    1933  AFC North             NaN
9    10   San Francisco 49ers  1,051  ...    1950   NFC West             NaN

[10 rows x 10 columns]

In [23]:
del nfl_frame['Stadium']
nfl_frame

   Rank                  Team     GP  Won  Lost  Tied   Pct.  Season   Division
0     1     Green Bay Packers  1,385  769   578    38  0.569    1921  NFC North
1     2        Dallas Cowboys    930  526   398     6  0.569    1960   NFC East
2     3      Baltimore Ravens    400  225   174     1  0.564    1996  AFC North
3     4         Chicago Bears  1,418  777   599    42  0.563    1920  NFC North
4     5  New England Patriots    933  519   405     9  0.561    1960   AFC East
5     6        Miami Dolphins    849  468   377     4  0.554    1966   AFC East
6     7     Minnesota Vikings    919  495   413    11  0.545    1961  NFC North
7     8    Kansas City Chiefs    933  496   425    12  0.537    1960   AFC West
8     9   Pittsburgh Steelers  1,221  644   556    21  0.536    1933  AFC North
9    10   San Francisco 49ers  1,051  552   485    14  0.532    1950   NFC West

In [24]:
my_ser = Series([1,2,3,4], index =['A','B','C','D'])
my_ser

A    1
B    2
C    3
D    4
dtype: int64

In [25]:
my_index = my_ser.index

In [26]:
my_index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [27]:
my_index[0]

'A'

In [28]:
my_index[2]

'C'

In [29]:
my_index[2:]

Index(['C', 'D'], dtype='object')

In [30]:
ser1 = Series([1,2,3,4], index = ['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [31]:
ser2 = ser1.reindex(['A','B','C','D','E','F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [32]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value = 0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [33]:
ser3 = Series(['USA','Mexico','Canada'], index = [0,5,10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [34]:
ser3.reindex(range(15),method = 'ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [35]:
dframe = DataFrame(randn(25).reshape((5,5)), index = ['A','B','D','E','F'],
                   columns = ['col1','col2','col3','col4','col5'])
dframe

       col1      col2      col3      col4      col5
A -0.334830  0.996724  0.028553 -0.098026  0.923997
B -0.328386  0.739169  0.209554  1.290290  0.312208
D -0.352329  1.493767  0.687509  0.511844  1.050248
E  0.682813 -1.289137 -1.125020  2.532720 -1.810973
F -0.926263 -0.352143  1.463657 -0.719171 -0.968676

In [36]:
new_index = ['A','B','C','D','E','F']
dframe2 = dframe.reindex(new_index)
dframe2

       col1      col2      col3      col4      col5
A -0.334830  0.996724  0.028553 -0.098026  0.923997
B -0.328386  0.739169  0.209554  1.290290  0.312208
C       NaN       NaN       NaN       NaN       NaN
D -0.352329  1.493767  0.687509  0.511844  1.050248
E  0.682813 -1.289137 -1.125020  2.532720 -1.810973
F -0.926263 -0.352143  1.463657 -0.719171 -0.968676

In [37]:
new_columns = ['col1','col2','col3','col4','col5','col6']
dframe2.reindex(columns = new_columns)

       col1      col2      col3      col4      col5  col6
A -0.334830  0.996724  0.028553 -0.098026  0.923997   NaN
B -0.328386  0.739169  0.209554  1.290290  0.312208   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -0.352329  1.493767  0.687509  0.511844  1.050248   NaN
E  0.682813 -1.289137 -1.125020  2.532720 -1.810973   NaN
F -0.926263 -0.352143  1.463657 -0.719171 -0.968676   NaN

In [38]:
dframe

       col1      col2      col3      col4      col5
A -0.334830  0.996724  0.028553 -0.098026  0.923997
B -0.328386  0.739169  0.209554  1.290290  0.312208
D -0.352329  1.493767  0.687509  0.511844  1.050248
E  0.682813 -1.289137 -1.125020  2.532720 -1.810973
F -0.926263 -0.352143  1.463657 -0.719171 -0.968676

In [39]:
ser1 = Series(np.arange(3),index = ['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int64

In [40]:
ser1.drop('b')

a    0
c    2
dtype: int64

In [41]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)), index = ['SF','LA','NY'], columns = ['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [42]:
dframe1.drop('LA',axis = 0)

    pop  size  year
SF    0     1     2
NY    6     7     8

In [43]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [44]:
dframe1.drop('year',axis = 1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

In [45]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [46]:
ser1 = Series(np.arange(3), index = ['A','B','C'])
ser1 = 2*ser1
ser1

A    0
B    2
C    4
dtype: int64

In [47]:
ser1['B']

2

In [48]:
ser1[1]

2

In [49]:
ser1[0:3]

A    0
B    2
C    4
dtype: int64

In [50]:
ser1[['A','B']]

A    0
B    2
dtype: int64

In [51]:
ser1[ser1 > 3]

C    4
dtype: int64

In [52]:
ser1[ser1 > 3] = 10

In [53]:
dframe = DataFrame(np.arange(25).reshape((5,5)), index = ['NYC','LA','SF','DC','Chi'],
                   columns = ['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [54]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int64

In [55]:
dframe[['B','C']]

      B   C
NYC   1   2
LA    6   7
SF   11  12
DC   16  17
Chi  21  22

In [56]:
dframe[dframe['C'] > 8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [57]:
dframe > 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [58]:
ser1 = Series([0,1,2],index = ['A','B','C'])
ser2 = Series([3,4,5,6],index = ['A','B','C','D'])

In [59]:
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [60]:
dframe1 = DataFrame(np.arange(4).reshape((2,2)),columns = ['A','B'],index = ['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [61]:
dframe2 = DataFrame(np.arange(9).reshape((3,3)),columns = ['A','D','C'],index = ['NYC','SF','LA'])
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [62]:
dframe1 + dframe2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [63]:
dframe1.add(dframe2,fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [64]:
ser3 = Series([0,1,2],index = ['A','D','C'])
ser3

A    0
D    1
C    2
dtype: int64

In [65]:
ser1 = Series(range(3),index = ['C','A','B'])
ser1

C    0
A    1
B    2
dtype: int64

In [66]:
ser1.sort_index()

A    1
B    2
C    0
dtype: int64

In [67]:
ser1

C    0
A    1
B    2
dtype: int64

In [71]:
ser2 = Series(randn(10))
ser2

0   -1.386625
1    0.047891
2   -0.426842
3    1.009323
4    0.083958
5   -0.320271
6   -0.358921
7    0.406481
8    0.597580
9   -1.557311
dtype: float64

In [72]:
ser2.rank()

0     2.0
1     6.0
2     3.0
3    10.0
4     7.0
5     5.0
6     4.0
7     8.0
8     9.0
9     1.0
dtype: float64

In [73]:
arr = np.array([[1,2,np.nan],[np.nan,3,4]])
arr

array([[ 1.,  2., nan],
       [nan,  3.,  4.]])

In [74]:
dframe1 = DataFrame(arr, index = ['A','B'], columns=['One','Two','Three'])
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [75]:
dframe1.sum()

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [77]:
dframe1.sum(axis=0)

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [78]:
dframe1.sum(axis=1)

A    3.0
B    7.0
dtype: float64

In [79]:
dframe1.min()

One      1.0
Two      2.0
Three    4.0
dtype: float64

In [80]:
dframe1.idxmin()

One      A
Two      A
Three    B
dtype: object

In [82]:
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [83]:
dframe1.cumsum()

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  5.0    4.0

In [84]:
dframe1.describe()

       One       Two  Three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [98]:
ser1 = Series(['w','w','x','y','z','w','w','x','x','y','a','z',])
ser1

0     w
1     w
2     x
3     y
4     z
5     w
6     w
7     x
8     x
9     y
10    a
11    z
dtype: object

In [99]:
ser1.unique()

array(['w', 'x', 'y', 'z', 'a'], dtype=object)

In [100]:
ser1.value_counts

<bound method IndexOpsMixin.value_counts of 0     w
1     w
2     x
3     y
4     z
5     w
6     w
7     x
8     x
9     y
10    a
11    z
dtype: object>

In [102]:
data = Series(['one','two',nan,'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [103]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [104]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [106]:
dframe = DataFrame([[1,2,3],[nan,5,6],[7,nan,9],[nan,nan,nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [107]:
dframe.dropna()

     0    1    2
0  1.0  2.0  3.0

In [109]:
dframe.dropna(how = 'all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [110]:
dframe.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [111]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [112]:
dframe2 = DataFrame([[1,2,3,nan],[2,nan,5,6],[nan,7,nan,9],[1,nan,nan,nan]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [113]:
dframe2.dropna(thresh = 2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [114]:
dframe2.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [115]:
dframe2.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [116]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [117]:
dframe2.fillna({0:0, 1:1, 2:2, 3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [119]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [120]:
dframe2.fillna(0, inplace = True)

In [121]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [123]:
ser = Series(np.random.randn(6), index = [[1,1,1,2,2,2,],['a','b','c','a','b','c']])
ser

1  a   -0.282020
   b   -1.265754
   c   -1.243538
2  a    0.487488
   b    0.064526
   c   -1.693214
dtype: float64

In [124]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [125]:
ser[1]

a   -0.282020
b   -1.265754
c   -1.243538
dtype: float64

In [126]:
ser[2]

a    0.487488
b    0.064526
c   -1.693214
dtype: float64

In [127]:
ser[:,'a']

1   -0.282020
2    0.487488
dtype: float64

In [128]:
ser[:,'b']

1   -1.265754
2    0.064526
dtype: float64

In [129]:
dframe = ser.unstack()

In [130]:
dframe

          a         b         c
1 -0.282020 -1.265754 -1.243538
2  0.487488  0.064526 -1.693214

In [131]:
dframe.unstack()

a  1   -0.282020
   2    0.487488
b  1   -1.265754
   2    0.064526
c  1   -1.243538
   2   -1.693214
dtype: float64

In [132]:
dframe.T.unstack()

1  a   -0.282020
   b   -1.265754
   c   -1.243538
2  a    0.487488
   b    0.064526
   c   -1.693214
dtype: float64

In [134]:
dframe2 = DataFrame(np.arange(16).reshape((4,4)),
                    index = [['a','a','b','b'],[1,2,1,2,]],
                    columns = [['NY','NY','LA','SF'],['cold','hot','hot','cold']])
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [135]:
dframe2.index.name2 = ['INDEX1','INDEX2']
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [137]:
dframe2.columns.names = ['Cities','Temp']
dframe2

Cities   NY      LA   SF
Temp   cold hot hot cold
a 1       0   1   2    3
  2       4   5   6    7
b 1       8   9  10   11
  2      12  13  14   15

In [138]:
dframe2.swaplevel('Cities','Temp',axis =1)

Temp   cold hot     cold
Cities   NY  NY  LA   SF
a 1       0   1   2    3
  2       4   5   6    7
b 1       8   9  10   11
  2      12  13  14   15

In [141]:
dframe2.sort_index(1).sort_index(0)

Cities  LA   NY       SF
Temp   hot cold hot cold
a 1      2    0   1    3
  2      6    4   5    7
b 1     10    8   9   11
  2     14   12  13   15

In [142]:
dframe2.sum(level = 'Temp',axis = 1)

Temp  cold  hot
a 1      3    3
  2     11   11
b 1     19   19
  2     27   27